Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་ བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མིག་ བཏུད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha called Reverent Eye.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕན་ འདོད་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Hitakāma would awaken to unsurpassable and perfect buddhahood. [65.a]

source: བྱང་ཆུབ་ སེམས་དཔའ་ [65a] སེམས་དཔའ་ ཆེན་པོ་ ཕན་ འདོད་ ཀྱིས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: Also this bodhisattva great being, Hitakāma, had noticed the great light and heard the sound of the clear voice.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཕན་ འདོད་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མིག་ བཏུད་ དེ་ག་ ལ་བ་ དེར་ སོང་ ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore went before the blessed thus-gone Reverent Eye and asked,

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དེ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied that blessed one,

source: རིགས་ ཀྱི་ བུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ སུམ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $398 “Noble son,” |#| “ thirty-three thousand innumerable universes away from this buddha realm lies a universe known as Enduring.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འདི་ལྟ་སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ བསམ་པ་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_།
en: Abiding and remaining present there, he is delivering the Dharma teachings of the Bodhisattva Collection that are known as ‘Truly Satisfying All Sentient Beings.’ ”

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to go to the world of Enduring so that I may see, venerate, and serve the blessed thus-gone Śākyamuni.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མིག་ བཏུད་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕན་ འདོད་ ཀྱི་ ལག་པ ར་ པད་མ་ ཆེན་པོ འི་ རྒྱལ་པོ་ མངོན་པར་ འཕགས་པ་ གཅིག་ བྱིན་ ཏེ
en: Then the thus-gone Reverent Eye placed a great and extraordinary king of lotus flowers in the bodhisattva Hitakāma’s hand and said,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ པད་མ འི་ རྒྱལ་པོ་ འདི་ ཕུལ་ ལ་
en: “Noble son, offer this king of lotuses to that blessed one, and

source: ང འི་ ཚིག་ གིས་ བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ མིག་ བཏུད་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ སྙུན་ གསོལ་ ལོ་ ཞེས་ དེ་སྐད་ ཅེས་ ཀྱང་ གསོལ་ ཅིག _།
en: ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕན་ འདོད་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་ ཕྱག་ འཚལ་ ཏེ །_
en: $401 The bodhisattva Hitakāma then bowed his head to the feet of that blessed one.

source: འདི་ལྟ་སྟེ །_ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ [65b] ལག་པ་ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ །_ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ཏེ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ གོ །_།
en: Having disappeared from that buddha realm he emerged all at once, in one instant and in one moment, [65.b] in the world of Enduring, as fast as an athlete can stretch out or bend an arm.

source: དེ་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས་ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: He then proceeded to Rājagṛha and the Kalandaka­nivāpa in the Veṇuvana, where he bowed his head to the feet of the Blessed One and sat to one side.

source: ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕན་ འདོད་ ཀྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Then he addressed the Blessed One:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ མིག་ བཏུད་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Reverent Eye inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ པད་མ་ ཆེན་པོ འི་ རྒྱལ་པོ་ འདི་ ཡང་ བསྐུར་བ་ ལགས་སོ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ ཏེ
en: He also offers you this great king of lotuses. |#| Blessed One, please accept it.”

source: བཞེས་ ནས་ |#| ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕན་ འདོད་ ལ་ བཀའ་ སྩལ་པ །_
en: $402 The Blessed One received the gift and asked,

source: ཕན་ འདོད་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: “Hitakāma, is that blessed one free from harm, is he strong, and does he remain unchanged?”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་ རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཉིས་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ མཐའ་ ཡ ས་ བརྩེགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $403 At that time there was in the east, beyond thirty-two thousand innumerable universes, a universe known as Array of Infinite Jewels, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དཀོན་མཆོག་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Ratnākara.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དཀོན་མཆོག་ འབྱུང་གནས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ བླ་མ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Highest Wisdom would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡེ་ཤེས་ བླ་མ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ ཆེན་པོ་ དེ་ཡང་ ཐོས་ སོ །_།
en: Also this bodhisattva great being, Highest Wisdom, had noticed the great light and heard the sound of the clear voice.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ བླ་མ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: He therefore asked that blessed one,

source: བཅོམ་ལྡན་འདས་ འོད་ དེ་ དང་ །_ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ སུ འི་ [66a] ལགས །_
en: “Blessed One, whose is this radiance and clear voice?” [66.a]

source: རིགས་ ཀྱི་ བུ་ ནུབ་ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཉིས་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $404 “Noble son,” |#| “thirty-two thousand innumerable universes away from this buddha realm there lies in the west a universe known as Enduring.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེ་ བཞིན་ གཤེགས་པ་ དཀོན་མཆོག་ འབྱུང་གནས་ དེ་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཡེ་ཤེས་ བླ་མ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $405 The bodhisattva great being Highest Wisdom then addressed the blessed thus-gone Ratnākara:

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ དེ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ བསམ་ གྱིས་ མི་ ཁྱབ་པ འི་ གོ་ཆ་ བགོས་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་དག་ ཀྱང་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to go to the world of Enduring so that I may see, venerate, and serve the blessed thus-gone Śākyamuni, and so that I may behold the bodhisattva great beings who have donned the inconceivable armor.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ བླ་མ འི་ ལག་པ ར་ མེ་ཏོག་ ཁ་དོག་ ལྔ་པ་ སྙིམ་པ་ གང་ བྱིན་ ཏེ
en: Then that blessed one gave the bodhisattva Highest Wisdom two handfuls of five-colored flowers and said,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ ཀྱིས་ བཅོམ་ལྡན་འདས་ དེ་ ལ་ མེ་ཏོག་ ཁ་དོག་ ལྔ་པ་ སྙིམ་པ་ གང་ འདི་ ཕུལ་ ལ །_
en: “Noble son, offer these two handfuls of five-colored flowers to that blessed one, and

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་པ་ དཀོན་མཆོག་ འབྱུང་ གནས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ལོ་ ཞེས་ དེ་སྐད་ ཅེས་ ཀྱང་ གསོལ་ ཅིག _།
en: ask him on my behalf whether he has encountered but little hardship or discomfort, and whether he remains healthy, strong, and at ease.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ བླ་མ ས་ བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_
en: $407 The bodhisattva Highest Wisdom then bowed his head to the feet of that blessed one.

source: འདི་ལྟ་སྟེ །_ དཔེར་ན་ སྐྱེས་བུ་ སྟོབས་ དང་ ལྡན་པ་ ཞིག་ གིས་ ལག་པ་ བསྐུམ་པ་ རྐྱོང་བ ར་ བྱེད་པ འམ །_ བརྐྱང་བ་ སྐུམ་པ ར་ བྱེད་པ འི་ སྐད་ཅིག་ དང་ །_ ཐང་ ཅིག་ དང་ ཡུད་ཙམ་ དེས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ནས་ མི་སྣང་བ ར་ གྱུར་ ཏེ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདིར་ འདུག་ གོ །_།
en: Having disappeared from that universe he emerged all at once, in one instant and in one moment, in the world of Enduring, as fast as an athlete can stretch out or bend an arm. [66.b]

source: དེ་ བཅོམ་ [66b] ལྡན་ འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ག་ལ་བ་ དེར་ སོང་ ནས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ གོ །_།
en: He then proceeded to the place where the blessed thus-gone Śākyamuni resided, bowed his head to his feet, and sat to one side.

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ ལ་ དེ་བཞིན་ གཤེགས་ པ་ དཀོན་མཆོག་ འབྱུང་གནས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the thus-gone Ratnākara inquires whether you have encountered but little hardship or discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ མེ་ཏོག་ ཁ་དོག་ ལྔ་པ་ སྙིམ་པ་ གང་ འདི་ བསྐུར་བ་ ལགས་ ན་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ སུ་ གསོལ །_
en: He also offers you these handfuls of five-colored flowers. |#| Blessed One, please accept them.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཞེས་ ཏེ །_ |#| བཞེས་ ནས་ |#| ཀྱང་ བཀའ་ སྩལ་པ །_
en: $408 The Blessed One received the gift and asked,

source: ཡེ་ཤེས་ བླ་མ་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་ སྙུན་ མི་ མངའ་ འམ །_ སྟོབས་ དང་ ལྡན་ ནམ །_ བདེ་བ་ དང་ ལྡན་ ནམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: “Highest Wisdom, is that blessed one free from distress, and is he strong, at ease, and unchanged?”

source: བཅོམ་ལྡན་འདས་ དེ་ལྟ་ ལགས་ སོ །_།
en: “Yes, indeed,”

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤོས་ ཀྱིས་ བརྒྱན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ
en: $409 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Adorned with Incense, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Gandhahastī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་ཆེན་ གླང་པོ་ཆེ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: This blessed one had prophesied that a bodhisattva known as Precious Elephant would awaken to unsurpassable and perfect buddhahood.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རིན་ཆེན་ གླང་པོ་ཆེ ས་ སྣང་བ་ ཆེན་པོ་ དེ་ མཐོང་ སྟེ །_ |#| གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ཡང་ ཐོས་ སོ །_།
en: The bodhisattva great being Precious Elephant had also noticed the great light and heard the sound of the clear voice.

source: དེ་ནས་ དེ་ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཞུས་པ །_
en: He therefore went before the thus-gone one, the worthy one, the perfect buddha Gandhahastī. |#| Bowing his head to that blessed one’s feet, he asked,

source: མཐུ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose are these powers?”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ དེས་ དེ་ |#| ལ་ བཀའ་ སྩལ་པ །_
en: replied the Blessed One,

source: རིགས་ ཀྱི་ བུ་ ནུབ་ ཀྱི་ ཕྱོགས་ ཀྱི་ ཕྱོགས་ཆ ར་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ འཇིག་ རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: $410 “Noble son,” |#| “thirty-one thousand innumerable universes away from this buddha realm there lies in the west a universe known as Enduring.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: Within it resides the thus-gone one, the worthy one, the perfect buddha Śākyamuni.

source: འཚོ་ ཞིང་ གཞེས་ ལ །_ འདི་ལྟ་སྟེ །_
en: Abiding and remaining present there, [67a]

source: བྱང་ཆུབ་ [67a] སེམས་དཔ འི་ སྡེ་སྣོད་ ཅེས་བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_ |#| དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: he is delivering the Dharma teachings that belong to the so-called Bodhisattva Collection.”#28 |#| . . . |#| “Yes, indeed,” answered the bodhisattva. [67.a]

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡོ་རྗེ འི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $411 At that time there was in the east, beyond thirty thousand innumerable universes, a universe known as Vajragarbha, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ མཆོག་ གི་ ཚོགས་ཅན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Supreme Accumulations.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ ཡེ་ཤེས་ ཚོགས་ཅན་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_ |#| དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: This blessed one had prophesied that a bodhisattva known as Possessor of the Stores of Wisdom would awaken to unsurpassable and perfect buddhahood . . . |#| . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཉིས་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྣ་ཚོགས་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $412 At that time there was in the east, beyond thirty-two thousand innumerable universes, a universe known as Variegated Banner, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ལྷུན་པོ འི་ ཕུང་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Majestic Mountain.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ངེས་ འདྲེན་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Definitive Guide would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” |#| answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཉིས་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་མ འི་ གདུགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $413 At that time there was in the east, beyond thirty-two thousand innumerable universes, a universe known as Lotus Parasol, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ གདུགས་ གཅིག་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Single Parasol.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་པོ་ཆེ འི་ མཛོད་ གཅིག་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Single Jewel Treasury would awaken to unsurpassable and perfect buddhahood. . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ འདས་པ་ [67b] ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ སྣང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $414 At that time there was in the east, beyond thirty thousand innumerable universes, [67.b] a universe known as Constant Illumination, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཐོགས་པ་ མེད་པ འི་ འཁོར་ལོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Unhindered Wheel.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Wisdom Leader would awaken to unsurpassable and perfect buddhahood . . . |#| . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་ པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $415 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Bhadra, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཙན་དན་ གྱི་ བསུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one known as Sandalwood Fragrance .

source: དེ་བཞིན་ གཤེགས་པ་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ ལྷུར་ལེན་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Pursuer of Wisdom would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ ཉི་ཁྲི་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟང་ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $416 At that time there was in the east, beyond twenty-nine thousand innumerable universes, a universe known as Bhadraka, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དཔུང་མགོ་ ཟླུམ་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Saṃvṛtta­skandha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཁྱད་པར་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་ བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Viśeṣamati would awaken to unsurpassable and perfect buddhahood . . .

source: དེ་ཡང་ འོངས་ ཏེ་ ཞེས་ བྱ་བ འི་ བར་ དང་ །_ དེ་ལྟ་ ལགས་སོ་ ཞེས་ བྱ་བ འི་ བར་ དུ་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ རོ །_།
en: . . . |#| “Yes, indeed,” answered the bodhisattva.

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $417 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Śrīratna, and

source: དེ་ ན་ དེ་ བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Jālinīprabha .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡེ་ཤེས་ དཔལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ [68a] ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Jñānaśrī would awaken to unsurpassable and perfect buddhahood . . . [68.a]

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $418 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Blissful Splendor, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཨུད་པ་ ལ་ དམར་པོ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Splendor of the Red Utpala.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ པད་མ་ མངོན་ འཕགས་ དཔལ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Glorious Noble Lotus would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རབ་ཏུ་ ཞི་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $419 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Praśama, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཡེ་ཤེས་ མེ་ཏོག་ རིན་པོ་ཆེ འི་ འོད་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Splendid Light of the Precious Wisdom Flower.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ མཆོག་ གི་ བཀོད་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Supreme Array would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ ཆིག་སྟོང་ འདས་པ་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ བཟང་ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $420 At that time there was in the east, beyond thirty-one thousand innumerable universes, a universe known as Bhadraka, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཟླ་བ་ འཕགས་པ འི་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Noble Moonlight.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རིན་པོ་ཆེ འི་ འོད་ ཟེར་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Ratnaprabha would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ སུམ་ ཁྲི་ འདས་པ་ ན་ འཇིག་ [68b] རྟེན་ གྱི་ ཁམས་ བཟོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $421 At that time there was in the east, beyond thirty thousand innumerable universes, [68.b] a universe known as Kṣānti, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ འཇིགས་པ་ དང་ བག་ཚ་བ་ ཐམས་ཅད་ རྣམ་པར་ འཇིག་པ ར་ མཛད་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as Destroyer of All Fear and Anxiety.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ བག་ཚ་བ་ མེད་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Niḥśaṅka would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་ མེད་པ་ སུམ་ ཁྲི་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ལྷུན་པོ འི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $422 At that time there was in the east, beyond thirty thousand innumerable universes, a universe known as Majestic Banner, and

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཕུང་པོ་ ཤིན་ཏུ་ བཤིག་པ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Demolished Mountain would awaken to unsurpassable and perfect buddhahood . . .

source: དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གྲངས་མེད་པ་ ཉི་ཁྲི་ དགུ་ སྟོང་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་ དང་ གནོད་པ་ ཐམས་ཅད་ ལས་ རྒལ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $423 At that time there was in the east, beyond twenty-nine thousand innumerable universes, a universe known as Beyond All Suffering and Harm, and

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ བདེ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: within it resided a thus-gone one, a worthy one, a perfect buddha known as King of Bliss.

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཚངས་པ འི་ དབྱངས་ ཀྱི་ ང་རོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ་ ཞེས་ བྱ་བ་ ནས །_
en: This blessed one had prophesied that a bodhisattva known as Roaring Melody of Brahmā would awaken to unsurpassable and perfect buddhahood . . . |#| . . .
